PatrickF1/fzf.fish
decors/fish-colored-man
edc/bass
gazorby/fish-abbreviation-tips
jethrokuan/z
jorgebucaran/autopair.fish
jorgebucaran/fisher
jorgebucaran/fishtape
jorgebucaran/getopts.fish
jorgebucaran/spark.fish
joseluisq/gitnow
rodrigobdz/fish-apple-touchbar
starship/starship
